In [30]:
import pandas as pd
 
employees = pd.DataFrame({
    'EmpCode': ['Emp001', 'Emp002', 'Emp003', 'Emp004', 'Emp005'],
    'Name': ['John', 'Doe', 'William', 'Spark', 'Mark'],
    'Occupation': ['Chemist', 'Statistician', 'Statistician',
                   'Statistician', 'Programmer'],
    'Date Of Join': ['2018-01-25', '2018-01-26', '2018-01-26', '2018-02-26',
                     '2018-03-16'],
    'Age': [23, 24, 34, 29, 40]})

In [31]:
employees

  EmpCode     Name    Occupation Date Of Join  Age
0  Emp001     John       Chemist   2018-01-25   23
1  Emp002      Doe  Statistician   2018-01-26   24
2  Emp003  William  Statistician   2018-01-26   34
3  Emp004    Spark  Statistician   2018-02-26   29
4  Emp005     Mark    Programmer   2018-03-16   40

In [32]:
employees=employees.loc[employees['Date Of Join'].sort_values(ascending=False).index]

In [33]:
employees

  EmpCode     Name    Occupation Date Of Join  Age
4  Emp005     Mark    Programmer   2018-03-16   40
3  Emp004    Spark  Statistician   2018-02-26   29
1  Emp002      Doe  Statistician   2018-01-26   24
2  Emp003  William  Statistician   2018-01-26   34
0  Emp001     John       Chemist   2018-01-25   23